{"version":"1","records":[{"hierarchy":{"lvl1":"Indicators Blog Collection"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Indicators Blog Collection"},"content":"Welcome to my technical blog posts.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Indicators Blog Collection","lvl2":"Posts"},"type":"lvl2","url":"/#posts","position":2},{"hierarchy":{"lvl1":"Indicators Blog Collection","lvl2":"Posts"},"content":"Check out my blog posts in the navigation.","type":"content","url":"/#posts","position":3},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/blog1","position":0},{"hierarchy":{"lvl1":""},"content":"Title\nInstitutional-Grade TradingView Indicator Review: EMA 5/13 Crossover with Volatility-Scaled Risk\n\nBrief Description\nThis review dissects a Pine Script v6 momentum-trend follower designed for TradingView. The strategy identifies short-term market shifts through an EMA 5/13 crossover model, utilizing ATR (Average True Range) for dynamic, volatility-adjusted stop losses and a high 3:1 Risk:Reward ratio. We explore architectural risks identified by quantitative analysis and implement institutional filters to reduce false signals.\n\nSource Links\nSource code: TradingView public Pine Script (Buy Sell Signal)\nPine Script Version: v6\n\nOriginal Code Segment (Pine Script)\nThe core logic relies on fast momentum shifts and candle confirmation to trigger entries. Below is the foundational script logic:// Trend Logic\nemaFast = ta.ema(close, 5)\nemaSlow = ta.ema(close, 13)\nbullTrend = emaFast > emaSlow\ntrendChange = bullTrend != bullTrend[1]\n\n// Entry Signals with Candle Confirmation\nbuySignal = bullTrend and trendChange and close > open\n\nRisk management is handled through a fixed Risk:Reward ratio and a tight volatility-based stop.atr = ta.atr(14)\nstopLoss = low - atr * 0.5 // Current 0.5 multiplier\ntakeProfit = entryPrice + (entryPrice - stopLoss) * 3.0\n\nCurrent Pros and Cons\n\nPros\n\nEarly Momentum Capture: The 5/13 EMA combination is highly responsive, allowing the strategy to identify and capture momentum bursts extremely early in a trend shift.\n\nDynamic Risk Scaling: By using ATR-based stops, the strategy adapts naturally to different market volatility regimes rather than relying on static price points.\n\nAdvanced Position Management: The script utilizes arrays to track intermediate Take Profit (TP) levels, providing a level of sophisticated execution tracking often missing in simpler scripts.\n\nCons\n\nThe Whipsaw Trap: In sideways or range-bound markets, this crossover logic generates frequent false positives, leading to rapid account drawdown.\n\nStop Compression Risks: The stop loss multiplier is mathematically too tight for most assets. It places the stop loss within daily price noise, resulting in a high noise-to-signal ratio.\n\nRigid Reward Architecture: A fixed 3:1 Risk:Reward ratio often ignores local liquidity pools or significant resistance zones that may prevent the asset from reaching its final target.\n\nWeak Points Identified\nThe most critical weak point is the strategy’s extreme vulnerability to market noise. Because the stop loss is set so close to the entry, minor fluctuations often trigger a stop-out before the actual trend develops. Additionally, there is a complete lack of a macro trend filter; without a long-term bias, the script may signal a Buy during a major bear market, resulting in low-probability trades. Finally, the script lacks institutional validation. Without checking for volume, signals can appear during low-liquidity periods where price movement is not supported by real market participation.\n\nSuggested Improvements\nTo elevate this script to an institutional standard, we recommend three high-impact improvisations:\n\nHigher Timeframe (HTF) Filter: Introduce a 200-period EMA. By only taking Long positions when the price is above the EMA 200, you ensure the trade aligns with the macro trend and avoid buying the dip in a bear market.\n\nATR Buffer Expansion: Increase the atrMultSL to at least 1.5. This statistically moves the stop loss outside the range of normal price noise to avoid being stop-hunted.\n\nVolume Validation: Require that volume must be greater than its 20-period Simple Moving Average. True trend shifts require institutional participation and liquidity to be sustainable.\n\nImproved Code Segment (Reworked Pine Script)\nThe following logic integrates these institutional filters to create a more robust decision-making tool:// Added Institutional Filters\nemaTrend = ta.ema(close, 200)\nvolMA = ta.sma(volume, 20)\n\n// Refined Entry Conditions\nlongFilter = close > emaTrend and volume > volMA\nshortFilter = close < emaTrend and volume > volMA\n\nbuySignal = bullTrend and trendChange and longFilter and close > open\nsellSignal = bearTrend and trendChange and shortFilter and close < open\n\n// Expanded Risk Management\nstopLoss = low - ta.atr(14) * 1.5 // Increased to 1.5 for noise reduction\n\nConclusion\nWhile the original script is an excellent beginner-level momentum tracker, its high noise-to-signal ratio makes it risky for serious investment. By integrating a 200 EMA macro filter and volume validation, we transform it into a robust strategy that aligns with institutional liquidity and long-term market trends. These changes allow an investor to ignore minor market ripples and focus on high-probability entries within established, strong trends.","type":"content","url":"/blog1","position":1},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/blog2","position":0},{"hierarchy":{"lvl1":""},"content":"Title\nAdvanced Market Sentiment Analysis: A Review of the LuxAlgo Buy Sell Calendar\n\nBrief Description\nThis review focuses on the Buy Sell Calendar [LuxAlgo], a sophisticated temporal sentiment aggregator. Unlike standard signal indicators, this tool provides a high-level overview of market trends by visualizing categorical data across daily or monthly timeframes.\n\nThe Buy Sell Calendar is designed as a Temporal Sentiment Aggregator. Rather than focusing on specific entry/exit candle triggers, it visualizes market trends through a calendar interface. It allows investors to see a “heatmap” of bullish or bearish dominance over a selected period using three distinct mathematical models: Linear Regression, Accumulated Delta, and Max/Min price discovery.\n\nSource Links\nSource code: TradingView public Pine Script (Buy Sell Calendar by LuxAlgo)\nPine Script Version: v5\n\nOriginal Code Segment (Pine Script)\nThe script’s logic is built around categorical trend determination. The Linear Regression method, for example, compares price slopes to detect momentum:// Linear Regression Trend Method\nn = 14\nsma = ta.sma(close, n)\nwma = ta.wma(close, n)\n\n// Trend: Bullish if WMA > SMA\ntrend = wma > sma ? 1 : 0\n\nIt also tracks intra-bar sentiment through Accumulated Delta:// Accumulated Delta Logic\ndelta = close - open\naccumDelta = ta.cum(delta)\n\nCurrent Pros and Cons\n\nPros\n\nMulti-Methodology Flexibility: Investors can toggle between Mean Reversion (Max/Min) and Momentum (Linreg) models, allowing the tool to adapt to different market conditions.\n\nQuantitative Edge Assessment: The indicator calculates a Bullish % for the entire period, providing a statistical probability rather than just a visual guess.\n\nVisual Clarity and Organization: By organizing data into a calendar dashboard, it helps investors identify cyclical patterns and seasonal trends that are often missed on a standard candlestick chart.\n\nCons\n\nRecalculation Bias: Because the trend is determined on the current bar’s close, the calendar colors can flicker or change during live execution before the period is finalized.\n\nLagging Indicator Nature: All three mathematical methods rely on historical lookbacks, which can cause the indicator to miss rapid, news-driven market reversals.\n\nExecution Gap: While excellent for sentiment, it lacks specific risk management parameters like Stop Loss or Take Profit levels, making it a decision-support tool rather than a standalone trading system.\n\nWeak Points Identified\nThe primary weakness for an investor is Categorical Oversimplification. By reducing a whole day or month to a single “Green” or “Red” box, the script hides the internal volatility and drawdown that occurred during that period. Additionally, there is a lack of volume-weighted confirmation; a day might end Bullish on very low volume, which is often a trap for long-term investors. Finally, the tool does not account for macro-economic gaps, where price jumps significantly at the market open, potentially skewing the Accumulated Delta logic.\n\nSuggested Improvements\n\nIntegrate Volume Weighting: Modify the sentiment logic so that Bullish days are only confirmed if the volume is above the 20-period average. This ensures the trend has institutional backing.\n\nAdd Volatility Heat Labels: Instead of a flat color, add a text label or intensity shade to the calendar boxes representing the ATR (Average True Range) of that period. This helps investors see if a Bullish day was stable or extremely volatile.\n\nHTF (Higher Timeframe) Alignment: Force the calendar to only show bullish sentiment if it aligns with a 200-day Moving Average. This prevents investors from being misled by a single Green day in a larger Bear market.\n\nImproved Code Segment (Reworked Pine Script)\nThis improved snippet integrates volume validation and a macro trend filter to ensure the calendar reflects high-probability sentiment:// Added Volume and Macro Filters\nema200 = ta.ema(close, 200)\nvolSMA = ta.sma(volume, 20)\n\n// Refined Trend Determination\nisInstitutionalVolume = volume > volSMA\nisAboveMacroTrend = close > ema200\n\n// Trend only confirms if Price > EMA200 AND Volume is high\nvalidBullishTrend = (wma > sma) and isAboveMacroTrend and isInstitutionalVolume\n\nConclusion\nThe LuxAlgo Buy Sell Calendar is a premier tool for identifying market regimes and seasonal sentiment. However, as a standalone tool, it carries risks related to lag and a lack of volume confirmation. By adding institutional volume filters and a 200-period EMA macro filter, investors can use this calendar to filter out market noise and focus on periods where price action is supported by both momentum and significant capital flow.","type":"content","url":"/blog2","position":1},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/blog3","position":0},{"hierarchy":{"lvl1":""},"content":"Title\nPrecision Scalping in High-Volatility Markets: A Review of the RSI Reversal Strategy (TPG Buy Sell RSI Scalp XAU)\n\nBrief Description\nThis review analyzes the RSI Signals (TPG Buy Sell RSI Scalp XAU), a mean-reversion scalping indicator built for high-volatility assets like Gold (XAU). Unlike trend-following strategies that try to ride long moves, this tool tries to catch short reversals when price becomes “too stretched” and is likely to snap back.\n\nThe script works using two confirmations together:\n\nA very fast RSI reading (7-period RSI) reaching extreme levels (85 for overbought, 15 for oversold).\n\nA reversal candlestick pattern appearing immediately after the extreme RSI (Engulfing candle, Hammer, Shooting Star, or other reversal setups).\n\nIn simple terms, it tries to detect “market exhaustion” — when buyers or sellers are out of energy — and then scalp the short bounce or drop that follows.\n\nSource Links\nSource code: TradingView public Pine Script (RSI Signals by TrungChuThanh)\nPine Script Version: v6\n\nOriginal Code Segment (Pine Script)\nThe main engine of the strategy is a fast RSI (7), which reacts much quicker than the standard RSI(14). This makes it sensitive enough for scalping.// RSI Settings for Aggressive Scalping\nrsiL = 7\nrsiOBI = 85 // Extreme Overbought\nrsiOSI = 15 // Extreme Oversold\nmyRsi = ta.rsi(close, rsiL)\n\n// Candlestick Confirmation (Bullish Engulfing)\nbull_engulf = close > open[1] and close[1] < open[1]\nbuySignal = (myRsi <= rsiOSI) and bull_engulf\n\nThe script also tries to detect exhaustion using Hammer candles. A Hammer indicates that price dropped strongly but was pushed back up, suggesting sellers are losing strength.// Hammer Identification Logic (Simplified View)\nbullFib = (low - high) * 0.333 + high\nhammer = bearCandle >= bullFib and rsiOS\n\nCurrent Pros and Cons\n\nPros\n\nStrong Signal Confirmation (Higher Confluence): The strategy only triggers when RSI reaches an extreme AND a reversal candle appears. This reduces random signals and focuses on stronger turning points.\n\nVery Fast Detection for Scalping: RSI(7) reacts quickly, which is useful on Gold where price moves fast and reversals can happen suddenly.\n\nMultiple Reversal Pattern Support: It checks different reversal patterns (Engulfing, Hammer, Shooting Star, two-candle logic), so it can capture different types of exhaustion moves instead of depending on just one pattern.\n\nCons\n\nThe RSI Trap (Big Risk): In strong trends, RSI can stay extreme for a long time. Example: in a powerful uptrend, RSI may remain above 85, but price still continues rising. This causes early sells (bad entries).\n\nWeak Exit Strategy: The script mainly focuses on entry signals and does not have a strong exit logic. In fast markets, this often leads to late exits or profits being lost.\n\nToo Sensitive in Noisy Markets: Because RSI is very fast, it may give too many signals during choppy news sessions (random price spikes without a clean reversal).\n\nWeak Points Identified\nThe biggest weakness is the absence of a big-picture trend filter. Scalping reversals without knowing the overall trend direction is risky. This is a common reason why traders lose money with mean-reversion indicators — they end up buying in downtrends and selling in uptrends.\n\nAnother weak point is that the strategy does not adjust based on volatility and liquidity conditions. A reversal candle formed during low participation (low volume / dead session) is less reliable than the same candle formed during a heavy trading period. Gold reversals are strongest when the market has real liquidity.\n\nFinally, the strategy lacks a dynamic profit-taking method. If the script targets a fixed risk-reward ratio every time, it may miss the fact that some reversals are small while others are large.\n\nSuggested Improvements\nTo improve reliability and make it safer, the following upgrades are recommended:\n\nAdd a Trend Bias Filter (EMA 200):\nOnly take Buy signals if price is above EMA 200.\nOnly take Sell signals if price is below EMA 200.\nThis prevents trading against the bigger trend and reduces “catching a falling knife.”\n\nAdd an RSI Midline Exit:\nInstead of waiting for a fixed take-profit every time, exit when RSI returns back to normal strength.\nA simple rule is: close the trade when RSI crosses back near 50.\nThis captures the main mean-reversion bounce instead of aiming for unrealistic targets.\n\nAdd a Time-of-Day Filter (Liquidity Filter):\nGold scalping is most reliable during high-volume sessions like the London and New York overlap.\nAvoid low-liquidity sessions where candles form without real market participation.\n\nImproved Code Segment (Reworked Pine Script)\nThis improved version adds trend alignment (EMA 200) and a more adaptive exit rule (RSI midline return). This makes the system behave more professionally and avoids trading against strong trends.// Trend Filter and Exit Filters\nemaTrend = ta.ema(close, 200)\nrsiMidline = 50\n\n// Improved Entry Logic (Trend Aligned)\nlongCondition = (myRsi <= rsiOSI) and bull_engulf and (close > emaTrend)\nshortCondition = (myRsi >= rsiOBI) and bear_engulf and (close < emaTrend)\n\n// Dynamic Exit: Close when RSI returns to neutral (50)\nexitLong = ta.crossover(myRsi, rsiMidline)\nexitShort = ta.crossunder(myRsi, rsiMidline)\n\nConclusion\nThe RSI Signals strategy is a sharp scalping tool designed to catch short-term reversals after extreme price moves. It performs best when the market is stretched and likely to snap back. However, without a trend filter, the strategy becomes risky in strong trending conditions where RSI can stay extreme for long periods.\n\nBy adding an EMA 200 trend bias, a midline RSI exit, and a liquidity/session filter, the indicator becomes far more reliable. These upgrades turn it from a raw signal generator into a more controlled and professional scalping system that aligns reversals with the bigger market direction.","type":"content","url":"/blog3","position":1},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/blog4","position":0},{"hierarchy":{"lvl1":""},"content":"Title\nTrading the Elasticity of Markets: A Review of the Envelope-RSI Mean Reversion Strategy\n\nBrief Description\nThe Envelope-RSI strategy is a dual-filter system designed to catch price reversals. It uses Price Envelopes to define the physical boundaries of “normal” price movement and the Relative Strength Index (RSI) to measure the internal momentum of the market. A signal is only generated when the price is physically over-extended (touching the envelope) and mathematically exhausted (RSI at an extreme).\n\nSource Links\nSource code: TradingView public Pine Script (Envelope - RSI by Saleh_Toodarvari)\nPine Script Version: v5\n\nOriginal Code Segment (Pine Script)\nThe strategy defines a channel (Envelope) based on an 8-period Moving Average, shifted by a fixed percentage (0.22%).// Envelope Calculation\nlen = 8\npercent = 0.22\nbasis = ta.sma(hl2, len)\nk = percent/100.0\nupper = basis * (1 + k)\nlower = basis * (1 - k)\n\n// RSI Logic for Filter\nrsiValue = ta.rsi(hl2, 8)\nrsiOB = 80\nrsiOS = 25\n\nThe signal triggers only when both the physical boundary and the momentum limit are reached simultaneously:// Entry Trigger\nbuySignal = ta.crossover(close, lower) and rsiValue < rsiOS\nsellSignal = ta.crossunder(close, upper) and rsiValue > rsiOB\n\nCurrent Pros and Cons\n\nPros\n\nDouble Filter Reliability: By requiring both an RSI extreme and an Envelope touch, the strategy significantly reduces the false signals (“head-fakes”) that occur when using RSI alone.\n\nDefined Boundaries: The visual envelopes provide investors with a clear trading range, making it easy to see when an asset is becoming overpriced or underpriced.\n\nIntegrated Risk Framework: The script includes built-in calculations for Take Profit and Stop Loss, offering a structured approach to every trade.\n\nCons\n\nThe Static Percentage Trap: The 0.22% envelope is fixed. This is very narrow for volatile assets like Bitcoin or Gold, where it may trigger too often, yet too wide for stable stocks.\n\nHigh-Frequency Scalping Risk: The default TP/SL levels (0.15%) are extremely tight. In many markets, trade costs (spread/fees) could consume most of the profit.\n\nTrend Blindness: In a runaway trend, price can ride the envelope for a long time, triggering multiple losing reversal signals while the market continues to climb or fall.\n\nWeak Points Identified\nThe most significant weakness is static volatility. Because the envelope percentage does not change, the strategy cannot distinguish between a quiet market and a high-volatility news event. Additionally, the use of a 15-minute timeframe for such tight targets is risky; at this speed, market noise often hits the stop loss before the mean reversion actually occurs. Finally, the strategy lacks a volume filter, meaning it might try to trade a reversal that has no real buying or selling strength behind it.\n\nSuggested Improvements\n\nReplace Static Envelopes with Bollinger Bands: Instead of a fixed 0.22%, use standard deviation-based Bollinger Bands. This allows the bands to expand during high volatility and contract during quiet times.\n\nAdd a Macro Trend Filter (EMA 200): To reduce runaway trend losses, only take long signals if price is above the 200 EMA. This ensures you buy dips in an uptrend instead of catching falling knives in downtrends.\n\nIncrease the TP/SL Ratio: Adjust risk management to target at least a 1.5:1 ratio. This ensures that a single win can cover more than one loss and gives the trade enough breathing room to develop.\n\nImproved Code Segment (Reworked Pine Script)\nThis improved logic replaces the static percentage with a volatility-adjusted band and adds a macro trend filter:// Volatility-Adjusted Envelope (Bollinger Style)\ndev = ta.stdev(close, 20)\nupperBand = basis + (dev * 2)\nlowerBand = basis - (dev * 2)\n\n// Institutional Filter\nema200 = ta.ema(close, 200)\ntrendLong = close > ema200\n\n// Refined Signal with Volatility & Trend Confirmation\nbuySignal = ta.crossover(close, lowerBand) and rsiValue < 25 and trendLong\nsellSignal = ta.crossunder(close, upperBand) and rsiValue > 80 and not trendLong\n\nConclusion\nThe Envelope-RSI strategy is a high-precision tool for mean reversion, but it requires careful calibration. In its original form, the static boundaries make it vulnerable to shifts in market volatility. By upgrading to volatility-adjusted bands and adding a macro trend filter, investors can transform this from a simple scalping script into a more robust strategy that respects the broader market direction.","type":"content","url":"/blog4","position":1},{"hierarchy":{"lvl1":""},"type":"lvl1","url":"/blog5","position":0},{"hierarchy":{"lvl1":""},"content":"Title\nBuying the Dip with Confidence: A Review of the Double EMA Pullback Strategy\n\nBrief Description\nThis review analyzes the Double EMA Pullback, a specialized “trend-following mean reversion” hybrid. Unlike fast scalping scripts, this strategy is designed to find high-probability entries within established market cycles by waiting for price dips to finish before entering.\n\nThe Double EMA Pullback strategy is built to trade in the direction of the big-picture trend. It uses a long-term hierarchy (the 50 and 200 EMAs) to establish the market regime and only identifies entries when the price undergoes a significant pullback (retracement) and subsequently recaptures its upward momentum. It is a patience-first strategy designed to avoid buying at the very top of a market move.\n\nSource Links\nSource code: TradingView public Pine Script (Double EMA Pullback by hanabil)\nPine Script Version: v5\n\nOriginal Code Segment (Pine Script)\nThe strategy establishes a trend hierarchy using the 50 EMA and the 200 EMA. A bullish market is defined only when the 50 EMA is above the 200 EMA.ema1 = ta.ema(close, 50)\nema2 = ta.ema(close, 200)\n\n// The Hierarchy: Only buy if 50 > 200\nbullTrend = ema1 > ema2\nbearTrend = ema1 < ema2\n\nThe unique trigger mechanism requires that the price was on the “wrong” side of the EMA 50 exactly 5 bars ago, confirming a real pullback occurred.// Entry Logic: Recapture after a pullback\nbuySignal = ta.crossover(close, ema1) and bullTrend and close[5] > ema1\nsellSignal = ta.crossunder(close, ema1) and bearTrend and close[5] < ema1\n\nCurrent Pros and Cons\n\nPros\n\nSuperior Trend Filtering: By utilizing the 200 EMA as a global filter, the strategy effectively eliminates counter-trend traps, ensuring you are not trying to buy during a major market crash.\n\nMomentum Confirmation: Requiring the price to cross back above the EMA 50 ensures that the pullback is actually over. This prevents investors from entering too early while the price is still falling.\n\nReduced Market Noise: Because this strategy focuses on larger moving averages (50/200), it ignores the minor flickers in price that often trick shorter-term indicators.\n\nCons\n\nArbitrary Pullback Timing: The backstep (defaulting to 5 bars) is a fixed number. In fast-moving markets, a pullback might take 10 bars; in slow markets, only 2. This lack of flexibility can cause missed opportunities.\n\nThe Exit Vacuum: The original script is excellent at finding entries but provides no automated logic for taking profits or setting stop losses. Investors are left to guess when to leave the trade.\n\nLagging Nature: Because it relies on the 200 EMA, the strategy can be slow to react to a total change in market direction, potentially keeping traders in a bullish mindset even after a crash has begun.\n\nWeak Points Identified\nThe most significant weakness for a long-term investor is the lack of risk management. Without a built-in stop loss or take profit mechanism, a single bad trade can erase the gains of multiple good trades. Furthermore, the strategy suffers from volatility blindness. It treats a 5-bar pullback in a calm market the same as a 5-bar pullback during a major news event, even though the risk levels are vastly different. Finally, there is no volume confirmation, meaning the recapture of the EMA 50 might happen on very low buying power, leading to a false breakout or fake-out.\n\nSuggested Improvements\n\nAdd an ATR-Based Stop Loss: Instead of guessing where to put a stop, use the Average True Range (ATR). This places the exit point just outside the normal market noise.\n\nIntegrate Volume Confirmation: Only trigger a buy if the volume on the crossover candle is higher than the 20-period average volume. This confirms that strong buyers are pushing price back up.\n\nAdd an RSI Overbought Exit: To solve the exit vacuum, use RSI as a profit-taking signal. If you are in a long trade and RSI hits 70, it may be time to take profit before the next pullback begins.\n\nImproved Code Segment (Reworked Pine Script)\nThis improved version adds institutional risk management and volume confirmation to the original pullback logic:// Added Institutional Filters\nvolMA = ta.sma(volume, 20)\natr = ta.atr(14)\n\n// Refined Entry: Added Volume Confirmation\nbuySignal = ta.crossover(close, ema1) and (ema1 > ema2) and (volume > volMA)\n\n// Integrated Risk Management\nstopLoss = low - (atr * 1.5)\ntakeProfit = close + (close - stopLoss) * 2.0 // Aiming for 2:1 Reward\n\nConclusion\nThe Double EMA Pullback is a sophisticated strategy for investors who prefer quality over quantity. It successfully filters out market noise and focuses on the primary trend. However, its lack of exit logic makes it incomplete as a standalone system. By adding ATR-based risk management and volume confirmation, this strategy can be transformed from a simple signal tool into a professional-grade trading system that protects capital while riding major trends.","type":"content","url":"/blog5","position":1}]}